var questions = [
    { //1
        q: 'Какие семьи, по мнению Л. Н. Толстого, похожи друг на друга?\n',
        v1: '1 - Несчастливые\n',
        v2: '2 - Счастливые\n',
        v3: '3 - Мудрые\n',
        v4: '4 - Веселые\n',
        correct: 2,
        gain: 1000
    },
    { //2
        q: 'Какое прозвище носил король Англии Ричард I?\n',
        v1: '1 - Храбрый\n',
        v2: '2 - Соловьиные Крылья\n',
        v3: '3 - Львиное Сердце\n',
        v4: '4 - Кровавый\n',
        correct: 3,
        gain: 3000
    },
    { //3
        q: 'Какой цвет получается при смешении синего и красного?\n',
        v1: '1 - Зеленый\n',
        v2: '2 - Коричневый\n',
        v3: '3 - Фиолетовый\n',
        v4: '4 - Розовый\n',
        correct: 3,
        gain: 5000 //несгораемая сумма
    },
    { //4
        q: 'В какой области не присуждают Нобелевскую премию?\n',
        v1: '1 - Математика\n',
        v2: '2 - Физика\n',
        v3: '3 - Литература\n',
        v4: '4 - Химия\n',
        correct: 1,
        gain: 10000
    },
    { //5
        q: 'Какая собачья кличка произошла от древнерусского названия кентавров?\n',
        v1: '1 - Рекс\n',
        v2: '2 - Бобик\n',
        v3: '3 - Тревор\n',
        v4: '4 - Полкан\n',
        correct: 4,
        gain: 50000
    },
    { //6
        q: 'Какой орган человека не функционирует до его рождения?\n',
        v1: '1 - Печень\n',
        v2: '2 - Легкие\n',
        v3: '3 - Почки\n',
        v4: '4 - Сердце\n',
        correct: 2,
        gain: 100000 //несгораемая сумма 
    },
    { //7
        q: 'Какой химический элемент назван в честь злого подземного гнома?\n',
        v1: '1 - Гафний\n',
        v2: '2 - Кобальт\n',
        v3: '3 - Бериллий\n',
        v4: '4 - Теллур\n',
        correct: 2,
        gain: 200000
    },
    { //8
        q: 'Сколько морей омывают Балканский полуостров?\n',
        v1: '1 - Три\n',
        v2: '2 - Четыре\n',
        v3: '3 - Пять\n',
        v4: '4 - Шесть\n',
        correct: 4,
        gain: 400000
    },
    { //9
        q: 'Какое имя не принимал ни один папа римский?\n',
        v1: '1 - Валентин\n',
        v2: '2 - Евгений\n',
        v3: '3 - Георгий\n',
        v4: '4 - Виктор\n',
        correct: 3,
        gain: 800000
    },
    { //10
        q: 'Какая из планет Солнечной системы самая горячая?\n',
        v1: '1 - Вене\n',
        v2: '2 - Легкие\n',
        v3: '3 - Почки\n',
        v4: '4 - Сердце\n',
        correct: 1,
        gain: 1000000
    }
]

