//плавная навигация

const anchors = document.querySelectorAll('body a[href*="#"]')

for (let anchor of anchors) {
    anchor.addEventListener('click', function (e) {
        e.preventDefault()

        const blockID = anchor.getAttribute('href').substr(1)

        document.getElementById(blockID).scrollIntoView({
            behavior: 'smooth',
            block: 'start'
        })
    })
};

// hamburger menu 

const hamburger = document.querySelector('.navigation__hamburger');
const navContainer = document.querySelector('.navigation__container');
const overlayMenu = document.querySelector('#overlay-hamburger');

hamburger.addEventListener('click', () => {
    hamburger.classList.toggle('active');
    navContainer.classList.toggle('active');
    overlayMenu.classList.toggle('active');
});

const navLink = document.querySelectorAll('.navigation__link');
const navBtn = document.querySelector('.navigation__button');

const closeMenu = () => {
    hamburger.classList.remove('active');
    navContainer.classList.remove('active');
    overlayMenu.classList.remove('active');
}

Array.from(navLink).forEach((link) => {
    link.addEventListener('click', closeMenu);
});
navBtn.addEventListener('click', closeMenu);

//модалка на отправку формы
// может, чтобы кнопка не залипала, вмест focus в css будем использовать какой-нибудь класс
// и будем его менять по клику?

const modal = document.getElementById('modal-respond');
const closeModalBtn = document.getElementsByClassName('modal-respond__close');
const overlayModal = document.getElementById('overlay-modal');

let modalTitleSucces = document.createElement('h3');
modalTitleSucces.className = "modal-respond__title";
modalTitleSucces.innerHTML = "Заявка успешно принята";

let modalTextSucces = document.createElement('p');
modalTextSucces.className = "modal-respond__text";
modalTextSucces.innerHTML = "Мы скоро с вами свяжемся!";

let modalTitleErr = document.createElement('h3');
modalTitleErr.className = "modal-respond__title";
modalTitleErr.innerHTML = "Упс! Что-то пошло не так :(";

let modalTextErr = document.createElement('p');
modalTextErr.className = "modal-respond__text";
modalTextErr.innerHTML = "Попробуйте повторить попытку позднее";

Array.from(closeModalBtn).forEach((item) => {
    item.addEventListener('click', () => {
        modal.classList.remove('modal-active');
        overlayModal.classList.remove('modal-active');
    })
});

overlayModal.addEventListener('click', () => {
    modal.classList.remove('modal-active');
    overlayModal.classList.remove('modal-active');
});

// формы
class BuyerForm {
    constructor(client) {
        this.client = client;
    }

    render() {
        return `
     <form action="#" method="post" id="form"  onsubmit="ym(83795386, 'reachGoal', 'Клик по кнопке Отправить_Покупатель')" name="feedback-form" class="feedback-form">
        <h3 class="feedback-form__title">Оставьте информацию о себе,
            и мы пришлем ссылку для доступа к платформе</h3>
        <div class="feedback-form__data-container">
            <div class="feedback-form__first-section">
                <div class="feedback-form__user">
                    <label for="name">Имя*</label>
                    <input type="text" id="name" name="username" class="feedback-form__user-input"
                        placeholder="Иван" pattern="^[A-za-zА-ЯЁа-яё - -]+$" required>
                </div>
                <div class="feedback-form__mail">
                    <label for="usermail">Email*</label>
                    <input type="email" id="usermail" name="usermail" class="feedback-form__mail-input"
                        placeholder="example@example.ru" pattern="^[a-z0-9.-_]+@[a-z]{2,20}.(ru|com)$" required>
                </div>
            </div>
            <div class="feedback-form__second-section">
                <div>
                    <p>Планирую завести:</p>
                    <div class="feedback-form__radiobutton-container">
                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M5.51776 15.9711C1.61998 15.2489 1.53221 8.97442 5.57443 9.0222C8.73776 9.05998 8.41887 12.1278 8.84665 11.5244C9.67776 10.3522 9.94554 7.33664 6.77776 6.08664C4.04332 5.00775 0.282204 7.19331 0.0410929 11.1878C-0.113352 13.7455 1.48221 18.47 7.21109 17.6833C15.2355 16.5822 9.41443 16.6922 5.51776 15.9711Z" fill="#D99E82"/>
                        <path d="M28.5322 24.3722C28.5322 24.3722 27.4033 26.9855 27.7811 33.5299C27.8489 34.7044 28.0133 35.9033 28.05 36.8877C30.0633 36.8877 29.8856 39.1811 29.4589 39.1811H26.2345C25.4756 39.1811 24.1311 35.3611 23.7767 30.06C23.4222 24.7577 28.5322 24.3722 28.5322 24.3722ZM15.3211 24.0044C15.3211 24.0044 14.6822 27.9244 11.2645 31.1299C10.9789 32.4222 10.41 35.8322 10.21 36.9022C12.3089 36.9022 11.6345 39.1766 11.0222 39.1766H8.08224C7.02557 39.1766 6.8689 35.3522 7.85335 30.6277C8.83668 25.9044 15.3211 24.0044 15.3211 24.0044Z" fill="#C1694F"/>
                        <path d="M4.21998 17.3933C5.6122 13.2244 12.2355 13.3622 19.7722 14.3211C23.1666 14.7533 23.8166 9.37329 23.8166 8.44773C23.8166 4.41884 27.4211 2.38662 31.0344 3.74884C31.9 4.0744 32.5922 5.22662 32.9833 5.82884C35.18 9.20329 38.1589 5.84551 38.4466 8.9644C38.7944 12.7366 36.5344 14.0022 32.8344 14.3211C30.7322 14.5022 28.9911 15.5377 28.5333 19.9255C28.3622 21.5611 28.8611 26.1966 25.88 27.7877C25.0133 31.0755 23.84 35.1377 23.38 37.2044C25.8822 37.7333 24.87 39.6255 24.87 39.6255C24.87 39.6255 21.3689 39.5777 20.6078 39.5777C19.7033 39.5777 20.3955 32.9377 21.6466 28.7033C16.3533 28.7511 12.9489 27.2177 11.87 26.7455C10.7278 30.0344 7.25665 30.7822 6.47998 32.1811C5.99887 33.0477 4.39331 35.94 4.25665 37.1766C6.03664 37.7544 5.46886 39.1011 5.26664 39.5344C4.06331 39.4866 1.68887 39.4866 1.37998 39.4866C0.146645 39.4866 2.64331 31.8155 3.69442 29.8055C4.89664 27.5044 2.82664 21.5622 4.21998 17.3933Z" fill="#D99E82"/>
                        <path d="M21.9267 27.1823C21.8778 27.5945 21.77 28.1723 21.6456 28.7034C16.3522 28.7512 12.9478 27.2178 11.8689 26.7456C12.1078 25.879 12.1245 25.3345 12.0589 25.0367C15.83 25.6556 17.1122 27.4867 21.9267 27.1823ZM32.8345 14.3212C30.7323 14.5023 30.14 15.509 29.6811 19.8967C29.51 21.5323 28.86 26.1967 25.88 27.7878C26.68 24.6901 28.0567 14.0234 32.8345 14.3212Z" fill="#F4C7B5"/>
                        <path d="M36.4967 7.40564C39.6 7.40564 38.6178 7.99008 38.7211 9.28564C38.8244 10.5812 38.8033 12.5923 37.8589 13.6512C36.6067 15.0534 33.5722 15.0579 32.0644 13.959C30.5567 12.8601 32.5356 7.40564 36.4967 7.40564Z" fill="#F4C7B5"/>
                        <path d="M37.2189 9.2511C37.34 10.0978 37.7678 10.5755 38.1956 10.51C39.04 10.38 39.7422 9.30221 39.7422 8.44776C39.7422 7.59332 39.0489 7.37776 38.1956 7.41665C37.0367 7.46999 37.0822 8.29221 37.2189 9.2511Z" fill="#272B2B"/>
                        <path d="M23.1478 10.0288C22.7611 12.8233 24.4333 13.2488 25.7956 13.2488C27.1578 13.2488 29.1889 11.8599 28.8489 9.05994C28.7 7.82994 28.2322 6.62328 27.95 5.53216C27.5767 4.08439 26.6178 3.60772 25.8456 4.01328C23.9956 4.98439 23.3978 8.23216 23.1478 10.0288Z" fill="#662113"/>
                        <path d="M31.0344 8.44772C30.465 8.44772 30.0033 7.98608 30.0033 7.41661C30.0033 6.84714 30.465 6.3855 31.0344 6.3855C31.6039 6.3855 32.0656 6.84714 32.0656 7.41661C32.0656 7.98608 31.6039 8.44772 31.0344 8.44772Z" fill="#292F33"/>
                        <path d="M18.85 14.21C18.7689 15.9122 17.8433 17.7411 15.8133 18.28C13.7011 18.8411 11.2356 18.4211 10.6244 15.53C10.5233 15.0522 10.48 14.17 10.5433 13.8478C12.9333 13.6489 15.7989 13.8478 18.85 14.21Z" fill="#C1694F"/>
                        <path d="M36.6078 12.2123C36.3083 12.2123 36.0655 11.9695 36.0655 11.67C36.0655 11.3706 36.3083 11.1278 36.6078 11.1278C36.9072 11.1278 37.15 11.3706 37.15 11.67C37.15 11.9695 36.9072 12.2123 36.6078 12.2123Z" fill="#D99E82"/>
                        <path d="M35.8944 11.1923C35.7294 11.1923 35.5956 11.0584 35.5956 10.8934C35.5956 10.7283 35.7294 10.5945 35.8944 10.5945C36.0595 10.5945 36.1933 10.7283 36.1933 10.8934C36.1933 11.0584 36.0595 11.1923 35.8944 11.1923Z" fill="#D99E82"/>
                        <path d="M35.4445 11.9689C35.2794 11.9689 35.1456 11.8351 35.1456 11.67C35.1456 11.5049 35.2794 11.3711 35.4445 11.3711C35.6095 11.3711 35.7433 11.5049 35.7433 11.67C35.7433 11.8351 35.6095 11.9689 35.4445 11.9689Z" fill="#D99E82"/>
                    </svg>
                    <input type="radio" name="pet-type" id="dog" value="dog"
                        class="feedback-form__dog-input">
                    <label for="dog" class="feedback-form__radiobutton-circle"></label>
                    <svg width="40" height="39" viewBox="0 0 40 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0)">
                        <path d="M28.3578 23.745C28.3578 23.745 27.5778 26.1588 28.7322 32.2032C28.9389 33.2879 29.2433 34.3958 29.3978 35.3037C31.35 35.3037 31.4544 37.4222 31.04 37.4222H28.7133C27.2278 37.4222 25.4122 33.8942 24.4311 28.9979C23.45 24.1016 28.3578 23.745 28.3578 23.745ZM13.8667 27.6625C13.8667 27.6625 11.3422 28.9535 11.4356 31.981C11.4722 33.1778 11.7122 34.1937 11.83 35.181C13.8656 35.181 13.8733 37.2815 13.28 37.2815H11.2178C10.1922 37.2815 7.88333 33.9397 7.46333 29.5767C7.04222 25.2148 13.8667 27.6625 13.8667 27.6625Z" fill="#F18F26"/>
                        <path d="M-3.43323e-05 8.93865C-3.43323e-05 3.73019 4.60108 1.05823 9.99997 1.05823C10.2947 1.05823 10.5773 1.16972 10.7856 1.36817C10.994 1.56662 11.1111 1.83578 11.1111 2.11643C11.1111 2.39708 10.994 2.66624 10.7856 2.86469C10.5773 3.06314 10.2947 3.17463 9.99997 3.17463C7.99552 3.17463 2.53664 4.16299 2.53664 8.93865C2.53664 11.9873 4.27774 14.7185 6.72552 15.2688C6.90774 15.1916 7.10886 15.1588 7.29108 15.0656C15.3344 10.9207 22.2433 16.0201 24.2089 14.7588C26.1555 13.508 24.8077 11.3143 27.3466 9.21061C27.7133 7.26246 28.5389 4.47304 29.34 4.47304C29.95 4.47304 30.7455 6.40426 31.2733 8.34183C31.93 6.88045 32.7877 5.42542 33.34 5.42542C34.0511 5.42542 34.76 7.83072 35.1111 9.90691C36.9777 11.1207 38.34 12.8794 38.34 14.9492C38.34 17.8064 33.84 18.5016 32.34 18.5588C30.84 18.6159 28.9811 22.3281 28.3566 23.926C26.9766 28.5471 26.0777 33.1312 25.3589 35.7598C27.1911 35.7598 27.3633 37.9937 26.8566 37.9937C26.0644 37.9937 24.6866 37.9905 24.3844 37.9937C22.85 38.0085 22.1333 33.0138 22.1333 28.6297C22.1333 28.4053 22.1455 27.9662 22.1455 27.9662C22.1455 27.9662 20.0011 28.5006 15.4366 27.7461C12.7211 27.2974 9.84774 28.6445 9.05219 31.0932C8.46663 32.8963 7.49774 34.5905 6.97663 35.8381C8.74219 35.8381 8.6933 37.9937 8.18108 37.9937C7.30663 37.9937 6.17997 38.0085 5.75552 37.9937C4.12441 37.9355 5.04108 29.9789 4.61108 27.309C4.18108 24.6392 3.2033 21.4064 4.86552 18C1.26997 16.1228 -3.43323e-05 12.1746 -3.43323e-05 8.93865Z" fill="#FFCC4E"/>
                        <path d="M33.34 13.4052C32.7877 13.4052 32.34 12.9789 32.34 12.4529C32.34 11.9269 32.7877 11.5005 33.34 11.5005C33.8923 11.5005 34.34 11.9269 34.34 12.4529C34.34 12.9789 33.8923 13.4052 33.34 13.4052Z" fill="#292F33"/>
                        <path d="M36.6844 13.6085C37.4367 14.0561 37.4367 15.4889 37.8122 15.4889C38.1878 15.4889 38.94 14.6466 38.94 13.6085C38.9411 12.5704 35.76 13.0582 36.6844 13.6085Z" fill="#E75A70"/>
                        <path d="M32.6911 15.1778C32.7367 15.2053 32.7911 15.2159 32.8489 15.2053C32.8689 15.2011 34.5689 14.9503 35.6767 15.3598C35.82 15.4127 36.0556 15.3355 36.1356 15.1577C36.2156 14.9799 36.11 14.7715 35.9667 14.7186C34.3667 14.1164 32.7922 14.4709 32.7067 14.4879C32.5522 14.5186 32.49 14.6889 32.4978 14.8815C32.5022 15.0022 32.6133 15.1302 32.6911 15.1778ZM33.2156 17.653C33.2427 17.6577 33.2705 17.6573 33.2974 17.6516C33.3243 17.646 33.3497 17.6353 33.3722 17.6201C33.3889 17.6096 34.8511 16.7418 36.0411 16.7175C36.1944 16.7143 36.38 16.5545 36.38 16.3567C36.38 16.1598 36.1967 16.0022 36.0422 16.0043C34.3178 16.0297 33.0156 16.9471 32.9433 16.9958C32.8133 17.0826 32.8278 17.2657 32.9133 17.4445C32.9678 17.5577 33.1233 17.6371 33.2156 17.653Z" fill="#FEE7B8"/>
                        <path d="M31.2734 8.33969C31.2734 8.33969 30.86 8.29842 30.3189 8.37461C30.0778 7.88784 29.6689 7.43598 29.6689 7.43598C29.6689 7.43598 29.3567 8.14286 29.24 8.6836C29.2122 8.81059 28.9978 8.80741 28.8822 8.8836C28.8822 8.8836 28.84 5.21905 29.8411 4.82434C29.84 4.82223 30.68 6.01376 31.2734 8.33969ZM35.1122 9.90477C35.1122 9.90477 34.6856 9.62223 34.1311 9.29736C33.89 8.63704 33.5 7.88678 33.5 7.88678C33.5 7.88678 33.1589 8.52381 33.1167 8.74392C32.8834 8.62328 32.8834 8.63175 32.6689 8.54286C32.6689 8.54286 32.7956 6.12381 33.89 5.86879C33.89 5.86879 34.7034 7.32064 35.1122 9.90477Z" fill="#F18F26"/>
                        <path d="M19.5 25.0201C22.4434 25.6233 22.1445 27.9641 22.1445 27.9641C22.1445 27.9641 20 28.4984 15.4356 27.7439C14.2685 27.5583 13.07 27.6968 11.9834 28.1429C13.7689 24.9185 16.7778 24.4614 19.5 25.0201Z" fill="#FFDD99"/>
                        <path d="M23.6823 14.9302C23.1534 15.6455 21.0189 17.436 20.6323 17.2148C20.2567 17 19.9767 15.0402 20.2523 14.3513C21.7289 14.7312 22.9023 15.0476 23.6823 14.9302ZM15.8778 17.7757C15.1856 17.9217 14.2034 14.6233 14.3111 13.4127C15.9211 13.4307 17.4 13.6836 18.7167 13.981C18.3445 15.1238 16.5467 17.6339 15.8778 17.7757ZM12.9589 13.4561C12.9123 14.2212 11.8678 16.2106 11.5311 16.3524C11.19 16.4974 9.65892 14.9566 9.45781 14.1714C10.5878 13.791 11.7645 13.5505 12.9589 13.4561Z" fill="#F18F26"/>
                        </g>
                        <defs>
                        <clipPath id="clip0">
                        <rect width="40" height="38.0952" fill="white" transform="matrix(-1 0 0 1 40 0)"/>
                        </clipPath>
                        </defs>
                    </svg><input type="radio" name="pet-type" id="cat" value="cat"
                            class="feedback-form__cat-input">
                        <label for="cat" class="feedback-form__radiobutton-circle"></label>
                    </div>
                </div>
                <div class="feedback-form__breed">
                    <p>Интересуюсь породой:</p>
                    <input type="text" placeholder="Введите породу животного" name="breed"
                        pattern="^([А-Яа-яё - -]{2,30}|[A-Za-z - -]{2,30})$" class="feedback-form__breed-input">
                </div>
            </div>
        </div>
        <div class="feedback-form__required-fields">
            <p>* - обязательные для заполнения поля</p>
            <input type="checkbox" name="pd-agreement" id="agreement" class="feedback-form__agreement-checkbox"
                required checked>
            <label for="agreement" class="feedback-form__agreement">Я даю согласие на
                обработку
                персональных данных*</label>
        </div>
        <button type="submit" class="feedback-form__submit-button">Отправить</button>
    </form>
        `
    }

    renderResult() {
        // document.querySelector("#form-container").innerHTML = "";
        return document.querySelector("#form-container").innerHTML = this.render();
    }

}

class BreederForm {
    constructor(client) {
        this.client = client;
    }

    render() {
        return `
     <form action="#" method="post" id="form" onsubmit="ym(83795386, 'reachGoal', 'Клик по кнопке Отправить_Заводчик')" name="feedback-form" class="feedback-form">
        <h3 class="feedback-form__title">Оставьте информацию о себе,
            и мы пришлем ссылку для доступа к платформе</h3>
        <div class="feedback-form__data-container">
            <div class="feedback-form__first-section">
                <div class="feedback-form__user">
                    <label for="name">Имя*</label>
                    <input type="text" id="name" name="username" class="feedback-form__user-input"
                    placeholder="Иван" pattern="^[A-za-zА-ЯЁа-яё - -]+$" required>
                </div>
                <div class="feedback-form__mail">
                    <label for="usermail">Email*</label>
                    <input type="email" id="usermail" name="usermail" class="feedback-form__mail-input"
                    placeholder="example@example.ru" pattern="^[a-z0-9.-_]+@[a-z]{2,20}.(ru|com)$" required>
                </div>
            </div>
            <div class="feedback-form__second-section">
                <div>
                    <p>Тип животного:</p>
                    <div class="feedback-form__radiobutton-container">
                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M5.51776 15.9711C1.61998 15.2489 1.53221 8.97442 5.57443 9.0222C8.73776 9.05998 8.41887 12.1278 8.84665 11.5244C9.67776 10.3522 9.94554 7.33664 6.77776 6.08664C4.04332 5.00775 0.282204 7.19331 0.0410929 11.1878C-0.113352 13.7455 1.48221 18.47 7.21109 17.6833C15.2355 16.5822 9.41443 16.6922 5.51776 15.9711Z" fill="#D99E82"/>
                        <path d="M28.5322 24.3722C28.5322 24.3722 27.4033 26.9855 27.7811 33.5299C27.8489 34.7044 28.0133 35.9033 28.05 36.8877C30.0633 36.8877 29.8856 39.1811 29.4589 39.1811H26.2345C25.4756 39.1811 24.1311 35.3611 23.7767 30.06C23.4222 24.7577 28.5322 24.3722 28.5322 24.3722ZM15.3211 24.0044C15.3211 24.0044 14.6822 27.9244 11.2645 31.1299C10.9789 32.4222 10.41 35.8322 10.21 36.9022C12.3089 36.9022 11.6345 39.1766 11.0222 39.1766H8.08224C7.02557 39.1766 6.8689 35.3522 7.85335 30.6277C8.83668 25.9044 15.3211 24.0044 15.3211 24.0044Z" fill="#C1694F"/>
                        <path d="M4.21998 17.3933C5.6122 13.2244 12.2355 13.3622 19.7722 14.3211C23.1666 14.7533 23.8166 9.37329 23.8166 8.44773C23.8166 4.41884 27.4211 2.38662 31.0344 3.74884C31.9 4.0744 32.5922 5.22662 32.9833 5.82884C35.18 9.20329 38.1589 5.84551 38.4466 8.9644C38.7944 12.7366 36.5344 14.0022 32.8344 14.3211C30.7322 14.5022 28.9911 15.5377 28.5333 19.9255C28.3622 21.5611 28.8611 26.1966 25.88 27.7877C25.0133 31.0755 23.84 35.1377 23.38 37.2044C25.8822 37.7333 24.87 39.6255 24.87 39.6255C24.87 39.6255 21.3689 39.5777 20.6078 39.5777C19.7033 39.5777 20.3955 32.9377 21.6466 28.7033C16.3533 28.7511 12.9489 27.2177 11.87 26.7455C10.7278 30.0344 7.25665 30.7822 6.47998 32.1811C5.99887 33.0477 4.39331 35.94 4.25665 37.1766C6.03664 37.7544 5.46886 39.1011 5.26664 39.5344C4.06331 39.4866 1.68887 39.4866 1.37998 39.4866C0.146645 39.4866 2.64331 31.8155 3.69442 29.8055C4.89664 27.5044 2.82664 21.5622 4.21998 17.3933Z" fill="#D99E82"/>
                        <path d="M21.9267 27.1823C21.8778 27.5945 21.77 28.1723 21.6456 28.7034C16.3522 28.7512 12.9478 27.2178 11.8689 26.7456C12.1078 25.879 12.1245 25.3345 12.0589 25.0367C15.83 25.6556 17.1122 27.4867 21.9267 27.1823ZM32.8345 14.3212C30.7323 14.5023 30.14 15.509 29.6811 19.8967C29.51 21.5323 28.86 26.1967 25.88 27.7878C26.68 24.6901 28.0567 14.0234 32.8345 14.3212Z" fill="#F4C7B5"/>
                        <path d="M36.4967 7.40564C39.6 7.40564 38.6178 7.99008 38.7211 9.28564C38.8244 10.5812 38.8033 12.5923 37.8589 13.6512C36.6067 15.0534 33.5722 15.0579 32.0644 13.959C30.5567 12.8601 32.5356 7.40564 36.4967 7.40564Z" fill="#F4C7B5"/>
                        <path d="M37.2189 9.2511C37.34 10.0978 37.7678 10.5755 38.1956 10.51C39.04 10.38 39.7422 9.30221 39.7422 8.44776C39.7422 7.59332 39.0489 7.37776 38.1956 7.41665C37.0367 7.46999 37.0822 8.29221 37.2189 9.2511Z" fill="#272B2B"/>
                        <path d="M23.1478 10.0288C22.7611 12.8233 24.4333 13.2488 25.7956 13.2488C27.1578 13.2488 29.1889 11.8599 28.8489 9.05994C28.7 7.82994 28.2322 6.62328 27.95 5.53216C27.5767 4.08439 26.6178 3.60772 25.8456 4.01328C23.9956 4.98439 23.3978 8.23216 23.1478 10.0288Z" fill="#662113"/>
                        <path d="M31.0344 8.44772C30.465 8.44772 30.0033 7.98608 30.0033 7.41661C30.0033 6.84714 30.465 6.3855 31.0344 6.3855C31.6039 6.3855 32.0656 6.84714 32.0656 7.41661C32.0656 7.98608 31.6039 8.44772 31.0344 8.44772Z" fill="#292F33"/>
                        <path d="M18.85 14.21C18.7689 15.9122 17.8433 17.7411 15.8133 18.28C13.7011 18.8411 11.2356 18.4211 10.6244 15.53C10.5233 15.0522 10.48 14.17 10.5433 13.8478C12.9333 13.6489 15.7989 13.8478 18.85 14.21Z" fill="#C1694F"/>
                        <path d="M36.6078 12.2123C36.3083 12.2123 36.0655 11.9695 36.0655 11.67C36.0655 11.3706 36.3083 11.1278 36.6078 11.1278C36.9072 11.1278 37.15 11.3706 37.15 11.67C37.15 11.9695 36.9072 12.2123 36.6078 12.2123Z" fill="#D99E82"/>
                        <path d="M35.8944 11.1923C35.7294 11.1923 35.5956 11.0584 35.5956 10.8934C35.5956 10.7283 35.7294 10.5945 35.8944 10.5945C36.0595 10.5945 36.1933 10.7283 36.1933 10.8934C36.1933 11.0584 36.0595 11.1923 35.8944 11.1923Z" fill="#D99E82"/>
                        <path d="M35.4445 11.9689C35.2794 11.9689 35.1456 11.8351 35.1456 11.67C35.1456 11.5049 35.2794 11.3711 35.4445 11.3711C35.6095 11.3711 35.7433 11.5049 35.7433 11.67C35.7433 11.8351 35.6095 11.9689 35.4445 11.9689Z" fill="#D99E82"/>
                    </svg>
                    <input type="radio" name="pet-type" id="dog" value="dog"
                            class="feedback-form__dog-input">
                        <label for="dog" class="feedback-form__radiobutton-circle"></label>
                        <svg width="40" height="39" viewBox="0 0 40 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0)">
                            <path d="M28.3578 23.745C28.3578 23.745 27.5778 26.1588 28.7322 32.2032C28.9389 33.2879 29.2433 34.3958 29.3978 35.3037C31.35 35.3037 31.4544 37.4222 31.04 37.4222H28.7133C27.2278 37.4222 25.4122 33.8942 24.4311 28.9979C23.45 24.1016 28.3578 23.745 28.3578 23.745ZM13.8667 27.6625C13.8667 27.6625 11.3422 28.9535 11.4356 31.981C11.4722 33.1778 11.7122 34.1937 11.83 35.181C13.8656 35.181 13.8733 37.2815 13.28 37.2815H11.2178C10.1922 37.2815 7.88333 33.9397 7.46333 29.5767C7.04222 25.2148 13.8667 27.6625 13.8667 27.6625Z" fill="#F18F26"/>
                            <path d="M-3.43323e-05 8.93865C-3.43323e-05 3.73019 4.60108 1.05823 9.99997 1.05823C10.2947 1.05823 10.5773 1.16972 10.7856 1.36817C10.994 1.56662 11.1111 1.83578 11.1111 2.11643C11.1111 2.39708 10.994 2.66624 10.7856 2.86469C10.5773 3.06314 10.2947 3.17463 9.99997 3.17463C7.99552 3.17463 2.53664 4.16299 2.53664 8.93865C2.53664 11.9873 4.27774 14.7185 6.72552 15.2688C6.90774 15.1916 7.10886 15.1588 7.29108 15.0656C15.3344 10.9207 22.2433 16.0201 24.2089 14.7588C26.1555 13.508 24.8077 11.3143 27.3466 9.21061C27.7133 7.26246 28.5389 4.47304 29.34 4.47304C29.95 4.47304 30.7455 6.40426 31.2733 8.34183C31.93 6.88045 32.7877 5.42542 33.34 5.42542C34.0511 5.42542 34.76 7.83072 35.1111 9.90691C36.9777 11.1207 38.34 12.8794 38.34 14.9492C38.34 17.8064 33.84 18.5016 32.34 18.5588C30.84 18.6159 28.9811 22.3281 28.3566 23.926C26.9766 28.5471 26.0777 33.1312 25.3589 35.7598C27.1911 35.7598 27.3633 37.9937 26.8566 37.9937C26.0644 37.9937 24.6866 37.9905 24.3844 37.9937C22.85 38.0085 22.1333 33.0138 22.1333 28.6297C22.1333 28.4053 22.1455 27.9662 22.1455 27.9662C22.1455 27.9662 20.0011 28.5006 15.4366 27.7461C12.7211 27.2974 9.84774 28.6445 9.05219 31.0932C8.46663 32.8963 7.49774 34.5905 6.97663 35.8381C8.74219 35.8381 8.6933 37.9937 8.18108 37.9937C7.30663 37.9937 6.17997 38.0085 5.75552 37.9937C4.12441 37.9355 5.04108 29.9789 4.61108 27.309C4.18108 24.6392 3.2033 21.4064 4.86552 18C1.26997 16.1228 -3.43323e-05 12.1746 -3.43323e-05 8.93865Z" fill="#FFCC4E"/>
                            <path d="M33.34 13.4052C32.7877 13.4052 32.34 12.9789 32.34 12.4529C32.34 11.9269 32.7877 11.5005 33.34 11.5005C33.8923 11.5005 34.34 11.9269 34.34 12.4529C34.34 12.9789 33.8923 13.4052 33.34 13.4052Z" fill="#292F33"/>
                            <path d="M36.6844 13.6085C37.4367 14.0561 37.4367 15.4889 37.8122 15.4889C38.1878 15.4889 38.94 14.6466 38.94 13.6085C38.9411 12.5704 35.76 13.0582 36.6844 13.6085Z" fill="#E75A70"/>
                            <path d="M32.6911 15.1778C32.7367 15.2053 32.7911 15.2159 32.8489 15.2053C32.8689 15.2011 34.5689 14.9503 35.6767 15.3598C35.82 15.4127 36.0556 15.3355 36.1356 15.1577C36.2156 14.9799 36.11 14.7715 35.9667 14.7186C34.3667 14.1164 32.7922 14.4709 32.7067 14.4879C32.5522 14.5186 32.49 14.6889 32.4978 14.8815C32.5022 15.0022 32.6133 15.1302 32.6911 15.1778ZM33.2156 17.653C33.2427 17.6577 33.2705 17.6573 33.2974 17.6516C33.3243 17.646 33.3497 17.6353 33.3722 17.6201C33.3889 17.6096 34.8511 16.7418 36.0411 16.7175C36.1944 16.7143 36.38 16.5545 36.38 16.3567C36.38 16.1598 36.1967 16.0022 36.0422 16.0043C34.3178 16.0297 33.0156 16.9471 32.9433 16.9958C32.8133 17.0826 32.8278 17.2657 32.9133 17.4445C32.9678 17.5577 33.1233 17.6371 33.2156 17.653Z" fill="#FEE7B8"/>
                            <path d="M31.2734 8.33969C31.2734 8.33969 30.86 8.29842 30.3189 8.37461C30.0778 7.88784 29.6689 7.43598 29.6689 7.43598C29.6689 7.43598 29.3567 8.14286 29.24 8.6836C29.2122 8.81059 28.9978 8.80741 28.8822 8.8836C28.8822 8.8836 28.84 5.21905 29.8411 4.82434C29.84 4.82223 30.68 6.01376 31.2734 8.33969ZM35.1122 9.90477C35.1122 9.90477 34.6856 9.62223 34.1311 9.29736C33.89 8.63704 33.5 7.88678 33.5 7.88678C33.5 7.88678 33.1589 8.52381 33.1167 8.74392C32.8834 8.62328 32.8834 8.63175 32.6689 8.54286C32.6689 8.54286 32.7956 6.12381 33.89 5.86879C33.89 5.86879 34.7034 7.32064 35.1122 9.90477Z" fill="#F18F26"/>
                            <path d="M19.5 25.0201C22.4434 25.6233 22.1445 27.9641 22.1445 27.9641C22.1445 27.9641 20 28.4984 15.4356 27.7439C14.2685 27.5583 13.07 27.6968 11.9834 28.1429C13.7689 24.9185 16.7778 24.4614 19.5 25.0201Z" fill="#FFDD99"/>
                            <path d="M23.6823 14.9302C23.1534 15.6455 21.0189 17.436 20.6323 17.2148C20.2567 17 19.9767 15.0402 20.2523 14.3513C21.7289 14.7312 22.9023 15.0476 23.6823 14.9302ZM15.8778 17.7757C15.1856 17.9217 14.2034 14.6233 14.3111 13.4127C15.9211 13.4307 17.4 13.6836 18.7167 13.981C18.3445 15.1238 16.5467 17.6339 15.8778 17.7757ZM12.9589 13.4561C12.9123 14.2212 11.8678 16.2106 11.5311 16.3524C11.19 16.4974 9.65892 14.9566 9.45781 14.1714C10.5878 13.791 11.7645 13.5505 12.9589 13.4561Z" fill="#F18F26"/>
                            </g>
                            <defs>
                            <clipPath id="clip0">
                            <rect width="40" height="38.0952" fill="white" transform="matrix(-1 0 0 1 40 0)"/>
                            </clipPath>
                            </defs>
                        </svg>
                            <input type="radio" name="pet-type" id="cat" value="cat"
                            class="feedback-form__cat-input">
                        <label for="cat" class="feedback-form__radiobutton-circle"></label>
                    </div>
                </div>
                <div class="feedback-form__breed">
                    <p>Порода:</p>
                    <input type="text" placeholder="Введите породу животного" name="breed"
                        pattern="^([А-Яа-яё - -]{2,30}|[A-Za-z - -]{2,30})$" class="feedback-form__breed-input">
                </div>
            </div>
        </div>
        <div class="feedback-form__required-fields">
            <p>* - обязательные для заполнения поля</p>
            <input type="checkbox" name="pd-agreement" id="agreement" class="feedback-form__agreement-checkbox"
                required checked>
            <label for="agreement" class="feedback-form__agreement">Я даю согласие на
            обработку
            персональных данных*</label>
        </div>
        <button type="submit" class="feedback-form__submit-button">Отправить</button>
    </form>
        `
    }

    renderResult() {
        return document.querySelector("#form-container").innerHTML = this.render();
    }

}

function generateForm(client) {
    if (client === 'breeder') {
        return new BreederForm();
    } else if (client === 'buyer') {
        return new BuyerForm();
    }
}

const checkClient = () => {
    let client = document.querySelector('.feedback__client:checked');
    let clientForm = generateForm(client.dataset.client);
    return clientForm.renderResult();
}
checkClient();

const toggleClient = (e) => {
    let form = generateForm(e.target.dataset.client);
    return form.renderResult();
}

const isSelectedForm = () => {
    let selectedForm = document.querySelector('input[name="client"]:checked');
    if (selectedForm.value == 'buyer') {
        return 'buyer';
    } else if (selectedForm.value == 'breeder') {
        return 'breeder';
    }
}

document.querySelectorAll('.feedback__client').forEach(el => {
    el.addEventListener('click', toggleClient);
});

//отправка формы

document.addEventListener('DOMContentLoaded', function () {
    const forms = document.querySelector('#feedback');
    forms.addEventListener('submit', async function formSend(e) {
        e.preventDefault();

        const form = document.querySelector('#form');

        const clientType = isSelectedForm();
        let formData = new FormData(form);
        formData.append('client', `${clientType}`);

        let response = await fetch('sendform.php', {
            method: 'POST',
            body: formData
        });

        if (response.ok) {
            document.querySelector('.modal-respond__header').replaceChild(modalTitleSucces, document.querySelector('.modal-respond__title'));
            document.querySelector('.modal-respond').replaceChild(modalTextSucces, document.querySelector('.modal-respond__text'));

            modal.classList.add('modal-active');
            overlayModal.classList.add('modal-active');
            form.reset();
        } else {
            document.querySelector('.modal-respond__header').replaceChild(modalTitleErr, document.querySelector('.modal-respond__title'));
            document.querySelector('.modal-respond').replaceChild(modalTextErr, document.querySelector('.modal-respond__text'));

            modal.classList.add('modal-active');
            overlayModal.classList.add('modal-active');
        }
    });
});
